       IDENTIFICATION DIVISION.
       PROGRAM-ID. changelogtrigger.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
           call 'create_function'
           stop run.
